OpenROAD 26Q1-1929-g7cf7b720fd 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 16 thread(s).
source external/bazel-orfs++orfs_repositories+docker_orfs/OpenROAD-flow-scripts/flow/platforms/asap7/liberty_suppressions.tcl
read_liberty external/bazel-orfs++orfs_repositories+docker_orfs/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_AO_RVT_FF_nldm_211120.lib.gz
read_liberty external/bazel-orfs++orfs_repositories+docker_orfs/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_INVBUF_RVT_FF_nldm_220122.lib.gz
read_liberty external/bazel-orfs++orfs_repositories+docker_orfs/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_OA_RVT_FF_nldm_211120.lib.gz
read_liberty external/bazel-orfs++orfs_repositories+docker_orfs/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SIMPLE_RVT_FF_nldm_211120.lib.gz
read_liberty external/bazel-orfs++orfs_repositories+docker_orfs/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SEQ_RVT_FF_nldm_220123.lib
read_db -hier bazel-out/k8-fastbuild/bin/serv/results/asap7/serv_rf_top/base/3_3_place_gp.odb
[WARNING ORD-0012] Hierarchical flow (-hier) is currently in development and may cause multiple issues. Do not use in production environments.
source external/bazel-orfs++orfs_repositories+docker_orfs/OpenROAD-flow-scripts/flow/platforms/asap7/setRC.tcl
estimate_parasitics -placement
Perform buffer insertion and gate resizing...
repair_design -verbose
Iteration |   Area    | Resized | Buffers | Nets repaired | Remaining
---------------------------------------------------------------------
        0 |     +0.0% |       0 |       0 |             0 |      8383
     1000 |     +0.0% |       0 |       0 |             0 |      7383
     2000 |     +0.0% |       0 |       0 |             0 |      6383
     3000 |     +0.0% |       0 |       0 |             0 |      5383
     4000 |     +0.0% |       0 |       0 |             0 |      4383
     5000 |     +0.0% |       0 |       0 |             0 |      3383
     6000 |     +0.0% |       0 |       0 |             0 |      2383
     7000 |     +0.0% |       0 |       0 |             0 |      1383
     8000 |     +0.0% |       0 |       0 |             0 |       383
    final |     +0.0% |       0 |       0 |             0 |         0
---------------------------------------------------------------------
Floating nets: 
Report metrics stage 3, resizer...

==========================================================================
resizer report_design_area
--------------------------------------------------------------------------
Design area 993 um^2 41% utilization.
Instance count before 8268, after 8268
Pin count before 27130, after 27130
write_db bazel-out/k8-fastbuild/bin/serv/results/asap7/serv_rf_top/base/3_4_place_resized.odb
Elapsed time: 0:04.60[h:]min:sec. CPU time: user 6.06 sys 0.73 (147%). Peak memory: 248532KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
3_4_place_resized                  4            242 171d5e870446b679733f
