OpenROAD 26Q1-1929-g7cf7b720fd 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 16 thread(s).
source external/bazel-orfs++orfs_repositories+docker_orfs/OpenROAD-flow-scripts/flow/platforms/asap7/liberty_suppressions.tcl
read_liberty external/bazel-orfs++orfs_repositories+docker_orfs/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_AO_RVT_FF_nldm_211120.lib.gz
read_liberty external/bazel-orfs++orfs_repositories+docker_orfs/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_INVBUF_RVT_FF_nldm_220122.lib.gz
read_liberty external/bazel-orfs++orfs_repositories+docker_orfs/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_OA_RVT_FF_nldm_211120.lib.gz
read_liberty external/bazel-orfs++orfs_repositories+docker_orfs/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SIMPLE_RVT_FF_nldm_211120.lib.gz
read_liberty external/bazel-orfs++orfs_repositories+docker_orfs/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SEQ_RVT_FF_nldm_220123.lib
read_db -hier bazel-out/k8-fastbuild/bin/vlsiffra/results/asap7/multiplier/base/3_3_place_gp.odb
[WARNING ORD-0012] Hierarchical flow (-hier) is currently in development and may cause multiple issues. Do not use in production environments.
source external/bazel-orfs++orfs_repositories+docker_orfs/OpenROAD-flow-scripts/flow/platforms/asap7/setRC.tcl
estimate_parasitics -placement
Perform buffer insertion and gate resizing...
repair_design -verbose
Iteration |   Area    | Resized | Buffers | Nets repaired | Remaining
---------------------------------------------------------------------
        0 |     +0.0% |       0 |       0 |             0 |      6052
     1000 |     +0.0% |       0 |       0 |             0 |      5052
     2000 |     +0.0% |       0 |       0 |             0 |      4052
     3000 |     +0.0% |       0 |       0 |             0 |      3052
     4000 |     +0.0% |       0 |       0 |             0 |      2052
     5000 |     +0.0% |       0 |       0 |             0 |      1052
     6000 |     +0.6% |       0 |      12 |             6 |        52
    final |     +0.6% |       0 |      12 |             6 |         0
---------------------------------------------------------------------
[INFO RSZ-0034] Found 6 slew violations.
[INFO RSZ-0038] Inserted 12 buffers in 6 nets.
Floating nets: 
Report metrics stage 3, resizer...

==========================================================================
resizer report_design_area
--------------------------------------------------------------------------
Design area 686 um^2 42% utilization.
Instance count before 5398, after 5410
Pin count before 16435, after 16459
write_db bazel-out/k8-fastbuild/bin/vlsiffra/results/asap7/multiplier/base/3_4_place_resized.odb
Elapsed time: 0:08.16[h:]min:sec. CPU time: user 7.67 sys 0.26 (97%). Peak memory: 239772KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
3_4_place_resized                  8            234 e93f230fbad5f29c5b41
